In [ ]:
Pandas >>Pythin Data Analysis

In [2]:
import pandas as pd
import numpy as np

In [ ]:
# Data Structure
# Data Structure are the set of data elements that produce well organized way of storing and organizing the data

In [ ]:
html >>

In [ ]:
Structure  >> Excel and csv
Semi-Structure >> JSON/html
Unstructure >> Audio/Video >>>

In [ ]:
# In pandas we have three major data structure
1) Series (1-D) >> Single feature / Column / single label / attribute /variable
            >> Homogeneous data type, Column names are Immutable, values are mutable

2) DataFrame (2-D) >> Rows and Columns
             >> Hetrogeneous Data Type, Size Mutable
3) Panel (3-D) >> Plane, Row ,Column

In [ ]:
{"Studen_Age-Data" :[502,20,15,18]}

In [ ]:
1. Used to read csv,excel etc
2. EDA
3. Data Cleaning 
4. Data Manupulation
5. Feature Engineering
   >> Encoding
   >> Outliers 
   >> Missing
   >> etc

In [ ]:
Gender >> Male Female >> 
{"Male" :0,"Female":1}
Gender  Gender
Male     0
Female   1
Male     1  
Male     1
Female   0
Female   0
Female   0
Female   0

## 1. Series

In [ ]:
Series >  1-D >>Array >> One column of Data Frame
Syntax >
 pd.Series(data,index,dtype)
    
data >> we can create series by using >> np.array,dict,list,tuple etc

In [3]:
# np.array

In [5]:
array = np.array([1,2,3,4,5])
series = pd.Series(array)
print(type(series))
series

<class 'pandas.core.series.Series'>

0    1
1    2
2    3
3    4
4    5
dtype: int32

In [6]:
array = np.array([1,2,3,4,"5"])  # string data type
series = pd.Series(array)
print(type(series))
series

<class 'pandas.core.series.Series'>

0    1
1    2
2    3
3    4
4    5
dtype: object

In [7]:
array = np.array([1,2,3,4,"5"])  # string data type
series = pd.Series(array,index =[10,20,30,40,50])
print(type(series))
series

<class 'pandas.core.series.Series'>

10    1
20    2
30    3
40    4
50    5
dtype: object

In [8]:
# Dict
dict1 = {"a":20,"b":30,"c":40,"d":60}
series = pd.Series(dict1)
series

a    20
b    30
c    40
d    60
dtype: int64

In [12]:
# Dict
dict1 = {"b":20,"a":30,"c":40,"d":60}
series = pd.Series(dict1,index = list("abcd") )
series

a    30
b    20
c    40
d    60
dtype: int64

In [ ]:
# ["a","b","c","d"]

In [11]:
list("abcd")

['a', 'b', 'c', 'd']

In [13]:
# Tuple
tup = (90,32,4,5)
series = pd.Series(tup,index = list("ABCD") )
series

A    90
B    32
C     4
D     5
dtype: int64

## 2) Data Frame  >df

In [ ]:
Data Frame >> 2-D > ROWS AND COLUMNS
> Syntax
pd.DataFrame(data,index,columns,dtype)
data >> list,numpy.array,series,csv,excel,json

In [17]:
# Empty data frame
df = pd.DataFrame()
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [18]:
# numpy.array
array = np.random.randint(10,80,size=(5,10))
df = pd.DataFrame(array)
df

    0   1   2   3   4   5   6   7   8   9
0  41  26  34  70  66  60  75  24  64  53
1  31  38  33  12  67  19  71  10  17  24
2  27  57  66  53  76  21  19  40  72  42
3  50  69  46  73  57  68  29  13  13  20
4  46  69  70  39  48  50  24  18  56  72

In [19]:
# numpy.array
array = np.random.randint(10,80,size=(5,10))
df = pd.DataFrame(array,columns=list("abcdefghij"))
df

    a   b   c   d   e   f   g   h   i   j
0  78  11  45  33  41  78  30  78  56  50
1  28  63  34  35  25  22  62  41  18  22
2  49  68  43  39  51  32  35  58  72  64
3  72  71  31  29  44  20  22  48  44  71
4  33  46  36  63  27  79  30  44  71  21

In [20]:
# numpy.array
array = np.random.randint(10,80,size=(5,10))
df = pd.DataFrame(array,columns=list("abcdefghij"),index = list("ABCDE"))
df

    a   b   c   d   e   f   g   h   i   j
A  18  35  61  74  62  61  79  55  72  59
B  67  67  75  78  68  75  19  74  66  71
C  67  72  37  47  42  46  46  45  39  75
D  14  31  56  31  61  19  50  39  59  35
E  18  47  72  62  21  32  34  23  67  25

In [27]:
df.to_csv("array1.csv",index=True)

In [25]:
df.to_csv("array.csv",index=False)

In [29]:
# read csv
df1 = pd.read_csv("array.csv",)
df1

    a   b   c   d   e   f   g   h   i   j
0  18  35  61  74  62  61  79  55  72  59
1  67  67  75  78  68  75  19  74  66  71
2  67  72  37  47  42  46  46  45  39  75
3  14  31  56  31  61  19  50  39  59  35
4  18  47  72  62  21  32  34  23  67  25

In [30]:
# fetching only columns name
df1.columns

Index(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'], dtype='object')

In [31]:
# read single column >>> Series
df1["a"] #

0    18
1    67
2    67
3    14
4    18
Name: a, dtype: int64

In [32]:
# read particular columns >> 2D
df1[["a","j"]]

    a   j
0  18  59
1  67  71
2  67  75
3  14  35
4  18  25

In [37]:
# Dict
dict1 = {"b": np.array([2,3,4,5,6]),"a":np.random.randint(20,100,size=5),"c":np.ones(5),"d":np.full(5,8)}
# dict1
df  = pd.DataFrame(dict1)
df

   b   a    c  d
0  2  51  1.0  8
1  3  64  1.0  8
2  4  86  1.0  8
3  5  81  1.0  8
4  6  60  1.0  8

In [42]:
df["add"] = df["b"] + df["d"]
df["Mul"] = df["b"] * df["d"]
df["div"] = df["add"] // 2
df["new_col"] = [np.nan,3,4,np.nan,34]
df

   b   a    c  d  add  Mul  div  new_col
0  2  51  1.0  8   10   16    5      NaN
1  3  64  1.0  8   11   24    5      3.0
2  4  86  1.0  8   12   32    6      4.0
3  5  81  1.0  8   13   40    6      NaN
4  6  60  1.0  8   14   48    7     34.0

In [43]:
df["new_col_2"] = pd.Series([np.nan,3,4,np.nan,34])
df

   b   a    c  d  add  Mul  div  new_col  new_col_2
0  2  51  1.0  8   10   16    5      NaN        NaN
1  3  64  1.0  8   11   24    5      3.0        3.0
2  4  86  1.0  8   12   32    6      4.0        4.0
3  5  81  1.0  8   13   40    6      NaN        NaN
4  6  60  1.0  8   14   48    7     34.0       34.0

In [44]:
# Transpose
df.T

              0     1     2     3     4
b           2.0   3.0   4.0   5.0   6.0
a          51.0  64.0  86.0  81.0  60.0
c           1.0   1.0   1.0   1.0   1.0
d           8.0   8.0   8.0   8.0   8.0
add        10.0  11.0  12.0  13.0  14.0
Mul        16.0  24.0  32.0  40.0  48.0
div         5.0   5.0   6.0   6.0   7.0
new_col     NaN   3.0   4.0   NaN  34.0
new_col_2   NaN   3.0   4.0   NaN  34.0

In [45]:
df["new"]   =set([2,5,6,69,8]) # we can not use set for creating series bcoz it is un ordered data type
df

TypeError: 'set' type is unordered

In [47]:
df["sub"] = df["add"] - 2
df

   b   a    c  d  add  Mul  div  new_col  new_col_2  sub
0  2  51  1.0  8   10   16    5      NaN        NaN    8
1  3  64  1.0  8   11   24    5      3.0        3.0    9
2  4  86  1.0  8   12   32    6      4.0        4.0   10
3  5  81  1.0  8   13   40    6      NaN        NaN   11
4  6  60  1.0  8   14   48    7     34.0       34.0   12

In [48]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   b          5 non-null      int32
 1   a          5 non-null      int32
 2   c          5 non-null      float64
 3   d          5 non-null      int32
 4   add        5 non-null      int32
 5   Mul        5 non-null      int32
 6   div        5 non-null      int32
 7   new_col    3 non-null      float64
 8   new_col_2  3 non-null      float64
 9   sub        5 non-null      int32
dtypes: float64(3), int32(7)
memory usage: 388.0 bytes

In [50]:
df.head()  # will returns only 5 rows

   b   a    c  d  add  Mul  div  new_col  new_col_2  sub
0  2  51  1.0  8   10   16    5      NaN        NaN    8
1  3  64  1.0  8   11   24    5      3.0        3.0    9
2  4  86  1.0  8   12   32    6      4.0        4.0   10
3  5  81  1.0  8   13   40    6      NaN        NaN   11
4  6  60  1.0  8   14   48    7     34.0       34.0   12

In [51]:
df.head(2)  # head will returns only 1st 5 rows

   b   a    c  d  add  Mul  div  new_col  new_col_2  sub
0  2  51  1.0  8   10   16    5      NaN        NaN    8
1  3  64  1.0  8   11   24    5      3.0        3.0    9

In [52]:
df.tail()  # tail will returns only last 5 rows

   b   a    c  d  add  Mul  div  new_col  new_col_2  sub
0  2  51  1.0  8   10   16    5      NaN        NaN    8
1  3  64  1.0  8   11   24    5      3.0        3.0    9
2  4  86  1.0  8   12   32    6      4.0        4.0   10
3  5  81  1.0  8   13   40    6      NaN        NaN   11
4  6  60  1.0  8   14   48    7     34.0       34.0   12

In [54]:
# excel
df = pd.read_excel("Student Data.xlsx")
df.head()

   Sr.No.                          Name  Mobile No.
0       1              Aishwarya Kahate  7745838082
1       2          Ankit Prakash Darade  9730508827
2       3               Shilpi Deshmukh  9827160183
3       4  Ghanshyam Madanlalji Agrawal  7693970260
4       5            Darpan Nandgaonkar  9545145740

In [55]:
df.tail()

    Sr.No.                    Name  Mobile No.
18      19    Mithilesh Shrikhande  7304993493
19      20   Bhupesh Natham Bopche  8421070721
20      21   Prajakta Jakoji Kulal  8788413982
21      22  Satish Balshiram Falke  7208742958
22      23   Reena Shrikant Sahane  8793159579

In [57]:
df.sample()  # will return single random row

   Sr.No.                    Name  Mobile No.
9      10  Yogesh Dilip Chaudhary  8329352348

In [62]:
df.sample(5)  # will return single random row

    Sr.No.                      Name  Mobile No.
10      11      Priti Santosh Dhumal  9579619665
7        8  Vishal Vilasraje Bhosale  9175916216
11      12       Nisha Ramesh Jadhav  7776894229
9       10    Yogesh Dilip Chaudhary  8329352348
18      19      Mithilesh Shrikhande  7304993493

In [67]:
df = pd.read_excel("Student Data.xlsx",sheet_name = "25th June") # 
df

    Sr.No.                         Name  Mobile No.
0        1         Sunil Changdeo Yeole  9146742693
1        2            Tabish akmal qazi  9028804010
2        3     Shubham Sambhaji salokhe  7020675593
3        4        Snehal Shivaji Kokate  7219369930
4        5          MORE SANTHOSH KUMAR  9959990913
5        6        AMAR DEVIDAS SHRINATH  7820823572
6        7         Rohit Bhaskar Mundhe  9545696311
7        8       Samadhan shivaji pawar  8421342247
8        9    Bhairavi Dattatray Bendre  8087867362
9       10        NILESH RAGHUNATH MALI  9699900532
10      11    Aarti Chandrakant Andhare  7276131695
11      12  Bhagyashri Abhishek Bochare  9561010331
12      13                  Vipin Saini  7351900653

In [68]:
df.tail()

    Sr.No.                         Name  Mobile No.
8        9    Bhairavi Dattatray Bendre  8087867362
9       10        NILESH RAGHUNATH MALI  9699900532
10      11    Aarti Chandrakant Andhare  7276131695
11      12  Bhagyashri Abhishek Bochare  9561010331
12      13                  Vipin Saini  7351900653

In [85]:
# misssing values
df = pd.read_csv("Emp_Records.csv")
df.head()

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,677509,Lois,36.36,60.0,13.68,NaN,Denver
1,940761,Brenda,NaN,NaN,9.01,51063.0,Stonewall
2,428945,Joe,NaN,68.0,NaN,50155.0,Michigantown
3,408351,Diane,NaN,NaN,18.30,NaN,Hydetown
4,193819,Benjamin,40.31,58.0,4.01,117642.0,Fremont

In [86]:
df.isna().sum()

Emp ID            0
First Name        0
Age in Yrs        3
Weight in Kgs     2
Age in Company    1
Salary            3
City              0
dtype: int64

In [87]:
df.isnull().sum()

Emp ID            0
First Name        0
Age in Yrs        3
Weight in Kgs     2
Age in Company    1
Salary            3
City              0
dtype: int64

In [88]:
# % of missing values
(df.isnull().sum())/ df.shape[0]

Emp ID            0.00
First Name        0.00
Age in Yrs        0.03
Weight in Kgs     0.02
Age in Company    0.01
Salary            0.03
City              0.00
dtype: float64

In [89]:
df.shape[0]

100

In [90]:
# shape >> return no of rows and no columns
df.shape

(100, 7)

In [91]:
df.shape[1]

7

In [92]:
# columns names
df.columns

Index(['Emp ID', 'First Name', 'Age in Yrs', 'Weight in Kgs', 'Age in Company',
       'Salary', 'City'],
      dtype='object')

In [100]:
index1 = np.random.randint(10,500,size=(df.shape[0]))

In [ ]:
pd.DataFrame(data,index = index1)

In [97]:
(df.shape[0])

100

In [94]:
len(df.columns[0])

6